app/controllers/admin/permissions_controller.rb

def index
	@ability = Ability.new(@user)
	@projects = Project.all
---
SELECT "projects".* FROM "projects"

def update
	@user.permissions.clear
	params[:permissions].each do |id, permissions|
	project = Project.find(id)
	permissions.each do |permission, checked|
		Permission.create!(:user => @user,
		:thing => project,
		:action => permission)
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "permissions".* FROM "permissions" WHERE "permissions"."user_id" = 4
INSERT INTO "permissions" ("action", "created_at", "thing_id", "thing_type", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["action", "view"], ["created_at", Wed, 15 Feb 2012 17:17:12 UTC +00:00], ["thing_id", 1], ["thing_type", "Project"], ["updated_at", Wed, 15 Feb 2012 17:17:12 UTC +00:00], ["user_id", 4]]

	def find_user
		@user = User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 3 LIMIT 1