app/controllers/admin/users_controller.rb

SELECT "users".* FROM "users" ORDER BY email
---
  def index
	@users = User.all(:order => "email")