app/views/tickets/show.html.erb

SELECT "assets".* FROM "assets" WHERE "assets"."ticket_id" = 1
---
  <div id='tags'><%= render @ticket.tags %></div>
  <% if @ticket.assets.exists? %>