app/controllers/projects_controller.rb

	def index
		@projects = Project.for(current_user).all
---
SELECT "projects".* FROM "projects"

	def edit
	@project = Project.for(current_user).find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]

	def update
	@project = Project.for(current_user).find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]

		def find_project
	@project = Project.for(current_user).find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "not-here"]]