app/controllers/tickets_controller.rb

INSERT INTO "tickets" ("created_at", "description", "project_id", "title", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Wed, 15 Feb 2012 00:00:55 UTC +00:00], ["description", "asdasdasdasdasd"], ["project_id", 1], ["title", "sad"], ["updated_at", Wed, 15 Feb 2012 00:00:55 UTC +00:00], ["user_id", 3]]
---
  def create
    @ticket = @project.tickets.build(params[:ticket].merge!(:user => current_user))
    if @ticket.save

SELECT "states".* FROM "states"
---
  def show
    @comment = @ticket.comments.build
    @states = State.all

SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]
---
    def find_project
      @project = Project.for(current_user).find(params[:project_id])

SELECT "tickets".* FROM "tickets" WHERE "tickets"."project_id" = 1 AND "tickets"."id" = ? LIMIT 1  [["id", "4"]]
---
    def find_ticket
      @ticket = @project.tickets.find(params[:id])